Repository: pancakevirus/nim-lang-081-docs-archived
Catalog: docs/OmegaT/OmegaT-level2.tmx
Source language: en_us
Languages: ja

source: struct statvfs Source Edit
ja: statvfs 構造体 ソース 編集

source: struct timespec Source Edit
ja: timespec 構造体 ソース 編集

source: struct timeval Source Edit
ja: timeval 構造体 ソース 編集

source: struct tm Source Edit
ja: tm 構造体 ソース 編集

source: struct utsname Source Edit
ja: utsname 構造体 ソース 編集

source: subsystem
ja: サブシステム

source: suspend proc
ja: suspend プロシージャ

source: symlinkExists proc
ja: symlinkExists プロシージャ

source: synchronize a file's buffer cache to the storage device Source Edit
ja: ストレージデバイスとファイルのバッファキャッシュを同期します ソース 編集

source: sysname*, ## Name of the hardware type on which the
ja: sysname*, ## システムを実行している

source: tabulator
ja: タブ

source: tailDir proc
ja: tailDir プロシージャ

source: tell Nim that define is a C preprocessor #define and so always needs to be mangled.
ja: Nim に Cプリプロセッサ定義 (#define)で define を識別させます。必ず修飾 (mangled) してください。

source: temp command
ja: temp コマンド

source: template instantiation
ja: テンプレートのインスタンス化

source: term rewriting macros
ja: 項の再書き換えマクロ

source: terminal's background colors Source Edit
ja: ターミナルの背景表示色 ソース 編集

source: terminal's foreground colors Source Edit
ja: ターミナルの文字表示色 ソース 編集

source: terminate proc
ja: terminate プロシージャ

source: test command
ja: test コマンド

source: text proc
ja: text プロシージャ

source: the CPUs to generate C code for; for example: "i386;amd64;powerpc"
ja: C コードの生成対象となる CPU です。例えば、 "i386;amd64;powerpc"

source: the Nim compiler itself; note that this code has been translated from a bootstrapping version written in Pascal, so the code is not a poster child of good Nim code
ja: Nim コンパイラ本体です。このコードは Pascal で書いたブートストラップの移植版であるため、 Nim のコードとしては良いお手本 (poster child) ではないことに注意してください

source: the Nim library
ja: Nim ライブラリ

source: the OSes to generate C code for; for example: "windows;linux;macosx"
ja: C コードの生成対象となるオペレーティング・システムです。例えば、 "windows;linux;macosx"

source: the application's type: "Console" or "GUI".
ja: アプリケーションの種類: "Console" または "GUI" です。

source: the base lexer.
ja: lexer の基底オブジェクトです。

source: the different modes of floating point formatting Source Edit
ja: the different modes of floating point formatting ソース 編集

source: the different names for binary prefixes Source Edit
ja: the different names for binary prefixes ソース 編集

source: the documentation; it is a bunch of reStructuredText files
ja: reStructuredText 形式のファイルをドキュメンテーションとして収録してあります

source: the filename of the application's license
ja: アプリケーションのライセンスファイル名

source: the library name is the same as the argument of the '-l' option Source Edit
ja: ライブラリ名は '-l' オプションで指定された引数と同じです ソース 編集

source: the list of known distributions Source Edit
ja: 上述のリストはディストリビューションとしても知られています。 ソース 編集

source: the match should have word boundaries (buggy for pegs!)
ja: 単語の境界に一致させます (PEG ではバグだらけです！)

source: the maximal number of bytes a varint can take Source Edit
ja: varint で扱える最大バイト数です。 ソース 変数

source: the parser object.
ja: パーサーのオブジェクトです。

source: the possible messages Source Edit
ja: 利用可能メッセージ ソース 編集

source: the possible node kinds of an PRstNode Source Edit
ja: PRstNode で利用可能なノードの種類 ソース 編集

source: the project's authors
ja: プロジェクトの作者

source: the project's description
ja: プロジェクトの概要

source: the project's long name; this can contain spaces.
ja: プロジェクトの正式名称です。これは空白文字を使えます。

source: the project's name; this needs to be a single word
ja: プロジェクト名。これは必ず単語で表してください。

source: the project's version
ja: プロジェクトのバージョン

source: the requested HttpMethod Source Edit
ja: the requested HttpMethod ソース 編集

source: the rope's length Source Edit
ja: the rope's length ソース 編集

source: the set of characters a newline terminator can start with (carriage return, line feed) Source Edit
ja: the set of characters a newline terminator can start with (carriage return, line feed) ソース 編集

source: the set of characters an identifier can consist of Source Edit
ja: the set of characters an identifier can consist of ソース 編集

source: the set of characters an identifier can start with Source Edit
ja: the set of characters an identifier can start with ソース 編集

source: the set of digits Source Edit
ja: the set of digits ソース 編集

source: the set of hexadecimal digits Source Edit
ja: the set of hexadecimal digits ソース 編集

source: the set of letters Source Edit
ja: the set of letters ソース 編集

source: the used request method Source Edit
ja: リクエストメソッドで使われます ソース 編集

source: the version of DOM API we try to follow.
ja: DOM API の対応バージョンです。

source: third argument to socket proc Source Edit
ja: third argument to socket proc ソース 編集

source: threads module
ja: threads モジュール

source: tracking cooldome, araq
ja: トラッキングは cooldome, araq

source: tries to execute the query and returns true if successful, false otherwise.
ja: クエリの実行を試行します。成功時は trueを、それ以外は false を返します。

source: tryRemoveFile proc
ja: tryRemoveFile プロシージャ

source: turn all runtime checks on|off
ja: ランタイム全体検査: 入 (on) ・切 (off)

source: turn assertions on|off
ja: アサーション: 入 (on) ・切 (off)

source: turn line tracing on|off
ja: ライントレース: 入 (on) ・切 (off)

source: turn obj conversion checks on|off
ja: obj 変換時の検査: 入 (on) ・切 (off)

source: turn on debugging info recording Source Edit
ja: デバッグ情報の記録を開始します ソース 編集

source: turn stack tracing on|off
ja: スタックトレース: 入 (on) ・切 (off)

source: turn support for multi-threading on|off
ja: マルチスレッドサポート: 入 (on) ・切 (off)

source: turns c into a string representation.
ja: c を文字列形式へ変換します。

source: type system, concepts
ja: 型システム、概念

source: type that represents a PEG Source Edit
ja: type that represents a PEG ソース 編集

source: type that represents an OS file handle; this is useful for low-level file access Source Edit
ja: オペレーティング・システムにおけるファイルハンドル表現型です。これは低水準ファイルアクセスで有用です。 ソース 編集

source: typeof operator
ja: typeof 演算子

source: uc_link*: ptr Ucontext ## Pointer to the context that is resumed
ja: uc_link*: ptr Ucontext ## このコンテキストが返されるときに

source: uc_sigmask*: Sigset ## The set of signals that are blocked when this
ja: uc_sigmask*: Sigset ## このコンテキストの有効であるとき

source: ucontext_t Source Edit
ja: ucontext_t 構造体 ソース 編集

source: undefine a conditional symbol
ja: 条件付きシンボルを未定義にします

source: undefine preprocess symbol 'sym' Source Edit
ja: プリプロセッサシンボル 'sym' を未定義化します ソース 編集

source: unloads the library lib Source Edit
ja: ライブラリ lib をアンロードします ソース 編集

source: unroll pragma
ja: unroll プラグマ

source: uri module
ja: uri モジュール

source: uri./ proc
ja: uri./ プロシージャ

source: uri.combine proc
ja: uri.combine プロシージャ

source: use add instead of append
ja: add は append の代わりに使います

source: use macros.eqIdent for that.
ja: 識別名との比較には macros.eqIdent をお使いください。

source: use this procedure to define a new XML tag Source Edit
ja: このプロシージャは新しい XML タグを定義します ソース 編集

source: used for block sizes Source Edit
ja: ブロックサイズで使用 ソース 編集

source: used for file block counts Source Edit
ja: ファイルブロック数で使用 ソース 編集

source: used pragma
ja: used プラグマ

source: used to wrap a static value in genericParams Source Edit
ja: used to wrap a static value in genericParams ソース 編集

source: utf-16BE, utf-32 conversions not supported on windows Source Edit
ja: Windows において utf-16BE, utf-32 の変換はサポートしていません。 ソース 編集

source: val is preferred, inconsistent right now
ja: val が好ましいのですが、現時点では一貫性はありません

source: validates data; raises ECgi if this fails.
ja: data の妥当性を検証します。失敗時は ECgi が発生します。

source: vertical tabulator
ja: 垂直タブ

source: vnode access was revoked Source Edit
ja: vnode access was revoked ソース 編集

source: vnode was removed Source Edit
ja: vnode was removed ソース 編集

source: vnode was renamed Source Edit
ja: vnode was renamed ソース 編集

source: waits on the condition variable cond.
ja: 状態変数 cond を待機します。

source: walkDir iterator
ja: walkDir イテレータ

source: walkDirRec iterator
ja: walkDirRec イテレータ

source: walkDirs iterator
ja: walkDirs イテレータ

source: walkFiles iterator
ja: walkFiles イテレータ

source: walkPattern iterator
ja: walkPattern イテレータ

source: warning pragma
ja: warning プラグマ

source: wd* {.importc: "wd".}: FileHandle ## Watch descriptor.
ja: wd* {.importc: "wd".}: FileHandle ## 監視用ディスクリプタ。

source: web command
ja: web コマンド

source: website of Nim; generated by nimweb from the *.txt and *.nimf files
ja: nimweb により *.txt と *.nimf ファイルから生成される Nim のウェブサイトです。

source: what kind of any it is Source Edit
ja: what kind of any it is ソース 編集

source: what to do in case of an error Source Edit
ja: エラー発生時の処理内容 ソース 編集

source: which document type to generate Source Edit
ja: which document type to generate ソース 編集

source: will print x + y = 30.
ja: x + y = 30 を出力します。

source: writes the bytes of a[start..start+len-1] to the file f.
ja: ファイル f に a[start..start+len-1] のバイトを書き込みます。

source: writes the bytes of buffer pointed to by the parameter buffer to the file f.
ja: バッファ buffer パラメータにより指されたバッファからバイトをファイル f へ書き込みます。

# writes the values x to f and then writes " ".
source: writes the values x to f and then writes "\n".
ja: f へ 値 x を書き込み後に "\n" を書き込みます。

source: yield real directories
ja: 実ディレクトリを作成します。

source: yield real files (default)
ja: 実ファイルを作成します (デフォルト)。

source: yield symbolic links to directories
ja: ディレクトリへシンボリックリンクを張ります。

source: yield symbolic links to files
ja: ファイルへシンボリックリンクを張ります。

source: yields all (key, value)-pairs of c starting with prefix.
ja: prefix を始点として c にある (key, value) の全ペアを生成します。

source: yields all (key, value)-pairs of c.
ja: c にある (key, value) の全ペアを生成します。

source: yields all keys in lexicographical order.
ja: 辞書式順序でキーをすべて生成します。

source: yields all keys starting with prefix.
ja: prefix を始点としたキーをすべて生成します。

source: yields all values of c in the lexicographical order of the corresponding keys.
ja: 対応するキーによる辞書式順序で c 値をすべて生成します。

source: yields all values of c starting with prefix of the corresponding keys.
ja: 対応するキーの prefix を始点として c にある (key, value) の全ペアを生成します。

source: # message.
ja: # 休止処理をします。

source: ## the Nim compiler
ja: ## コマンド (例えば 'c', 'cpp', 'doc')

source: command, ## experimental: the command (e.g. 'c', 'cpp', 'doc') passed to
ja: command, ## 試験機能: Nim コンパイラへ渡される

source: Note
ja: 注意

source: Module
ja: モジュール

source: Path
ja: パス

source: Name
ja: 名前

source: Key
ja: キー

source: ## UI applications.
ja: ## バッファ処理を最適化します。

source: ## Windows: Named pipes are used so that you can peek
ja: ## プロセスの出力ストリームを読み出し可能 (peek)

source: ## variable.
ja: ## システムに要求します。

source: Currently this only affects
ja: これは Windows に限り動作します:

source: ## addresses (in network byte order) for the
ja: ## ポインタ配列へのポインタであり、

source: ## alternative host names, terminated by a
ja: ## ポインタ配列へのポインタであり、

source: ## alternative network names, terminated by a
ja: ## ポインタ配列へのポインタであり、

source: ## alternative service names, terminated by
ja: ## ポインタ配列へのポインタであり、

source: ## function or one of the macros
ja: ## あるいは IG_IGN または

source: ## host, terminated by a null pointer.
ja: ## NULL ポインタで終端します。

source: ## null pointer.
ja: ## NULL ポインタで終端します。

source: sa_handler*: proc (x: cint) {...}{.noconv.} ## Pointer to a signal-catching
ja: sa_handler*: proc (x: cint) {...}{.noconv.} ## シグナル補足関数のポインタ、

source: h_aliases*: cstringArray ## A pointer to an array of pointers to
ja: h_aliases*: cstringArray ## 代替ホスト名の

source: s_aliases*: cstringArray ## A pointer to an array of pointers to
ja: s_aliases*: cstringArray ## 代替サービス名の

source: s_port*: cint ## The port number at which the service
ja: s_port*: cint ## ネットワーク・バイトオーダー形式による

source: s_proto*: cstring ## The name of the protocol to use when
ja: s_proto*: cstring ## サービス問い合わせ時に

source: h_addr_list*: cstringArray ## A pointer to an array of pointers to network
ja: h_addr_list*: cstringArray ## ホストにおけるネットワークアドレス (ネットワーク・バイトオーダー形式) の
